#include "Dynamic Array.h"
using namespace std;
using namespace Dynamic;
int main(){
    DynamicArray<int> arr;
    int choice;
    double tmp;
    setlocale(LC_ALL,"Russian");
    while(true){
        cout<<"--------------------------------------------------------\n";
        arr.show();
        cout<<"--------------------------------------------------------\n";
        cout<<"Введите действие:"<<endl;
        cout<<"1)Узнать эл под индексом X"<<endl;
        cout<<"2)Узнать размер массива"<<endl;
        cout<<"3)Установить эл под индексом Х"<<endl;
        cout<<"4)Вставить элемент перед индексом Х"<<endl;
        cout<<"5)Вставка в конец"<<endl;
        cout<<"6)Удаление с конца"<<endl;
        cout<<"7)Найти элемент по значению"<<endl;
        cout<<"8)Изменить размер массива"<<endl;
        cout<<"X)Выход"<<endl;
        cout<<">>";cin>>choice;
        switch(choice){
            case 1:
                cout<<"--------------------------------------------------------\n";
                cout<<"Введите индекс\n";
                cout<<">>";cin>>choice;
                cout<<"arr[i] = "<<arr.get_el(choice)<<endl;
                cout<<"--------------------------------------------------------\n";
                break;
            case 2:
                cout<<"--------------------------------------------------------\n";
                cout<<"Размер массива: "<<arr.get_size()<<endl;
                cout<<"--------------------------------------------------------\n";
                break;
            case 3:
                cout<<"--------------------------------------------------------\n";
                cout<<"Под каким индексом хотите установить элемент?\n";
                cout<<">>";cin>>choice;
                cout<<"Какое значение?\n";
                cout<<">>";cin>>tmp;
                arr.set_el(choice,tmp);
                cout<<"--------------------------------------------------------\n";
                break;
            case 4:
                cout<<"--------------------------------------------------------\n";
                cout<<"Перед каким индексом хотите вставить элемент?\n";
                cout<<">>";cin>>choice;
                cout<<"Какое значение?\n";
                cout<<">>";cin>>tmp;
                arr.insert_back(choice,tmp);
                cout<<"--------------------------------------------------------\n";
                break;
            case 5:
                cout<<"--------------------------------------------------------\n";
                cout<<"Какой элемент вставите?\n";
                cout<<">>";cin>>tmp;
                arr.pushback(tmp);
                cout<<"--------------------------------------------------------\n";
                break;
            case 6:
                arr.popback();
                break;
            case 7:
                cout<<"--------------------------------------------------------\n";
                cout<<"Какой элемент надо найти?\n";
                cout<<">>";cin>>tmp;
                (arr.find_el(tmp))?cout<<"Найден!\n":cout<<"Не найден!\n";
                cout<<"--------------------------------------------------------\n";
                break;
            case 8:
                cout<<"--------------------------------------------------------\n";
                cout<<"Введите новый размер\n";
                cout<<">>";cin>>choice;
                arr.set_size(choice);
                cout<<"--------------------------------------------------------\n";
                break;
            default:
                cout<<"[!]Выход из программы[!]\n";
                return 0;
                break;
        }//switch
    }//while
    return 0;
}

